app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)
    if @picture.save
---
INSERT INTO "pictures" ("artist", "created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["artist", "test"], ["created_at", Tue, 08 Apr 2014 22:33:15 UTC +00:00], ["title", "test"], ["updated_at", Tue, 08 Apr 2014 22:33:15 UTC +00:00], ["url", "..com"]]

  def update
    @picture = Picture.find(params[:id])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "1"]]